double a[n][n+1]; // n неизвестных, n строк, последний столбец - правая часть уравнений

double* x; 
x = (double *)malloc(n* sizeof(double)); // корни

for (k = 0; k<n; k++) //Поиск максимального элемента в первом столбце
{
    aa = abs(a[k][k]);
    i = k;
    for(m = k+1; m<n; m++)
        if(abs(a[m][k])>aa)
        {
            i = m;
            aa = abs(a[m][k]);
        }

        if (aa == 0)   //проверка на нулевой элемент
        {
            cout<<"Система не имеет решений"<<endl;
        }

        if (i != k)  //  перестановка i-ой строки, содержащей главный элемент k-ой строки
        {
            for (j=k; j < n+1; j++)
            {
                bb = a[k][j];
                a[k][j] = a[i][j];
                a[i][j] = bb;
            }
        }
        aa = a[k][k];//преобразование k-ой строки (Вычисление масштабирующих множителей)
        a[k][k] = 1;   
        for (j=k+1;j<n+1;j++) 
            a[k][j] = a[k][j]/aa;
        for (i = k+1; i < n; i++)//преобразование строк с помощью k-ой строки
        {
            bb = a[i][k];
            a[i][k] = 0;
            if (bb!=0)
                for (j=k+1; j< n+1; j++)
                    a[i][j]=a[i][j]-bb*a[k][j];
        }
}

for (i=n-1; i>=0; i--)   //Нахождение решений СЛАУ
{
    x[i] = 0;
    aa = a[i][n];
    for (j = n; j>i; j--) 
        aa = aa-a[i][j]*x[j];
    x[i] = aa;
}